---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarContainerBarType
source: html/b2430217-2b69-14a2-647e-5c304634b957.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarContainerBarType Property

"Bar Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarContainerBarType { get; }
```